<font size="+5">#01 | Data Tables & Basic Concepts of Programming</font>

- Subscribe to my [Blog â†—](https://blog.pythonassembly.com/)
- Let's keep in touch on [LinkedIn â†—](www.linkedin.com/in/jsulopz) ðŸ˜„

# Define a Variable

> Asign an `object` (numbers, text) to a `variable`.

In [1]:
photometry = ph

NameError: name 'ph' is not defined

donde deberia estar definido? donde busca python?

- el registro...

# The Registry (_aka The Environment_)

> Place where Python goes to **recognise what we type**.

In [7]:
type(89)

int

In [8]:
type(34.35)

float

In [9]:
type('hola')

str

In [14]:
type([])

list

In [15]:
type(())

tuple

In [16]:
type({})

dict

In [17]:
type([45, 'hola'])

list

# Use of Functions

## Predefined Functions in Python (_Built-in_ Functions)

> https://docs.python.org/3/library/functions.html

In [18]:
[l,m, x, j, v, s, b]

NameError: name 'l' is not defined

In [21]:
j = 'hola'

In [22]:
['l','m', 'x', j, v, s, b]

NameError: name 'v' is not defined

In [24]:
dias= ['l','m', 'x', 'j', 'v', 's', 'b']

In [25]:
len(dias)

7

In [26]:
sum(dias)

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [27]:
ingresos = [3,43,523,523]

In [29]:
sum(ingresos)

1092

## Discipline to Search Solutions in Google

> Apply the following steps when **looking for solutions in Google**:
>
> 1. **Necesity**: How to load an Excel in Python?
> 2. **Search in Google**: by keywords
>   - `load excel python`
>   - ~~how to load excel in python~~
> 3. **Solution**: What's the `function()` that loads an Excel in Python?
>   - A Function to Programming is what the Atom to Phisics.
>   - Every time you want to do something in programming
>   - **You will need a `function()`** to make it
>   - Theferore, you must **detect parenthesis `()`**
>   - Out of all the words that you see in a website
>   - Because they indicate the presence of a `function()`.

## External Functions

> Download [this Excel](https://github.com/sotastica/data/raw/main/internet_usage_spain.xlsx).
> Apply the above discipline and make it happen ðŸš€
> I want to see the table, c'mon ðŸ‘‡

In [30]:
df = pd.read_excel (r'Path where the Excel file is stored\File name.xlsx')

NameError: name 'pd' is not defined

porque salta este error?

- `pd` no esta en el registro

In [33]:
pd = 'hola que tal'

In [34]:
df = pd.read_excel (r'Path where the Excel file is stored\File name.xlsx')

AttributeError: 'str' object has no attribute 'read_excel'

In [35]:
pd

'hola que tal'

In [36]:
pd.capitalize()

'Hola que tal'

In [37]:
pd.title()

'Hola Que Tal'

In [38]:
pd.split()

['hola', 'que', 'tal']

In [39]:
import pandas

In [41]:
pandas.read_html(io='https://en.wikipedia.org/wiki/List_of_countries_and_dependencies_by_population')[0]

,Rank,Country / Dependency,Region,Population,% of world,Date,Source (official or from the United Nations),Notes
0,â€“,NaN,World,7923476000,NaN,16 Jan 2022,UN projection[1],NaN
1,1,China,Asia,1411778724,NaN,1 Nov 2020,2020 census result[2],"The census figure refers to mainland China, ex..."
2,2,India,Asia,1386866394,NaN,16 Jan 2022,National population clock[3],The figure includes the population of India-ad...
3,3,United States,Americas,333061898,NaN,16 Jan 2022,National population clock[4],Includes the 50 states and the District of Col...
4,4,Indonesia[b],Asia,271350000,NaN,31 Dec 2020,National annual estimate[5],NaN
...,...,...,...,...,...,...,...,...
237,â€“,Niue (New Zealand),Oceania,1549,NaN,1 Jul 2021,National annual projection[90],NaN
238,â€“,Tokelau (New Zealand),Oceania,1501,NaN,1 Jul 2021,National annual projection[90],NaN
239,195,Vatican City,Europe,825,NaN,1 Feb 2019,Monthly national estimate[189],The total population of 825 consisted of 453 r...
240,â€“,Cocos (Keeling) Islands (Australia),Oceania,573,NaN,30 Jun 2020,National annual estimate[188],NaN
241,â€“,Pitcairn Islands (United Kingdom),Oceania,40,NaN,1 Jan 2021,National annual estimate[190],NaN

In [42]:
pandas.read_clipboard()

    1    Male  48    University
0   0    Male  59           PhD
1   1  Female  44           PhD
2   1  Female  34           PhD
3   1  Female  49           PhD
4   1    Male  43    University
5   1    Male  23    Elementary
6   1    Male  29  Higher Level
7   0  Female  73    Elementary
8   0  Female  42    Elementary
9   1  Female  26    Elementary
10  0  Female  48    Elementary
11  0    Male  79    No studies
12  1    Male  38    Elementary
13  0  Female  61    Elementary
14  1    Male  34  Higher Level
15  1  Female  40    Elementary
16  1  Female  19    Elementary
17  1  Female  30   High School

In [43]:
import pandas as pd

In [47]:
pd.read_excel(io='internet_usage_spain.xlsx', sheet_name=1)

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

## The Elements of Programming

> - `Library`: where the code of functions are stored.
>   - `Function`: execute several lines of code with one `word()`.
>       - `Parameter`: to **configure** the function's behaviour.
>           - `Object`: **data structure** to store information.

In [49]:
'hola Juan, "como estas"'

'hola Juan, "como estas"'

In [50]:
'hola Juan, 'como estas''

SyntaxError: invalid syntax (1108903602.py, line 1)

## Code Syntax

**What happens inside the computer when we run the code?**

> In which order Python reads the line of code?
> - From left to right.
> - From up to down.
> Which elements are being used in the previous line of code?

1. `library`
2. `.` **DOT NOTATION** para acceder dentro de la libreria
3. `function()`
4. pasando `objetos` a los `parametros`
5. ejecutamos
6. magia borras
7. la funcion nos devuelve un `objeto`

In [53]:
type('internet_usage_spain.xlsx')

str

In [54]:
type(1)

int

## Functions inside Objects

> - The `dog` makes `guau()`: `dog.guau()`
> - The `cat` makes `miau()`: `cat.miau()`
> - What could a `DataFrame` make? `object.` + `[tab key]`

In [64]:
pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1).describe()

       internet_usage          age
count     2455.000000  2455.000000
mean         0.535642    46.798778
std          0.498830    17.824150
min          0.000000    18.000000
25%          0.000000    32.000000
50%          1.000000    44.000000
75%          1.000000    61.000000
max          1.000000    95.000000

In [65]:
pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1).describe().sum()

internet_usage    2459.034471
age               2769.622928
dtype: float64

In [69]:
pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1).describe().sum().describe()

count       2.000000
mean     2614.328700
std       219.619204
min      2459.034471
25%      2536.681585
50%      2614.328700
75%      2691.975814
max      2769.622928
dtype: float64

In [66]:
pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1).describe().sum().mean()

2614.328699627561

In [68]:
pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1).describe().sum().mean().describe()

AttributeError: 'numpy.float64' object has no attribute 'describe'

In [70]:
df = pd.read_excel(io='data/internet_usage_spain.xlsx', sheet_name=1)

In [72]:
df.describe()

       internet_usage          age
count     2455.000000  2455.000000
mean         0.535642    46.798778
std          0.498830    17.824150
min          0.000000    18.000000
25%          0.000000    32.000000
50%          1.000000    44.000000
75%          1.000000    61.000000
max          1.000000    95.000000

In [73]:
df.describe().sum()

internet_usage    2459.034471
age               2769.622928
dtype: float64

In [74]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
df.rea

In [ ]:
pd.rea

In [75]:
df.describe()

       internet_usage          age
count     2455.000000  2455.000000
mean         0.535642    46.798778
std          0.498830    17.824150
min          0.000000    18.000000
25%          0.000000    32.000000
50%          1.000000    44.000000
75%          1.000000    61.000000
max          1.000000    95.000000

In [ ]:
pd.des

## Conclusion | Types of Functions

> 1. Buit-in (Predefined) Functions
> 2. External Functions from Libraries
> 3. Functions within Objects

# Accessing `Objects`

> Objects are **data structures** that store information. 
> Which **syntax** do we use to access the information?

## Dot Notation `.`

In [76]:
df

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [77]:
df.education

0        Elementary
1        Elementary
2        University
3               PhD
4               PhD
           ...
2450     Elementary
2451    High School
2452     Elementary
2453    High School
2454     Elementary
Name: education, Length: 2455, dtype: object

In [78]:
type(df)

pandas.core.frame.DataFrame

In [79]:
df

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [80]:
type(df.education)

pandas.core.series.Series

In [81]:
df.education

0        Elementary
1        Elementary
2        University
3               PhD
4               PhD
           ...
2450     Elementary
2451    High School
2452     Elementary
2453    High School
2454     Elementary
Name: education, Length: 2455, dtype: object

## Square Brackets `[]`

In [82]:
df[education]

NameError: name 'education' is not defined

In [83]:
df['education']

0        Elementary
1        Elementary
2        University
3               PhD
4               PhD
           ...
2450     Elementary
2451    High School
2452     Elementary
2453    High School
2454     Elementary
Name: education, Length: 2455, dtype: object

In [84]:
df[['education']]

        education
0      Elementary
1      Elementary
2      University
3             PhD
4             PhD
...           ...
2450   Elementary
2451  High School
2452   Elementary
2453  High School
2454   Elementary

[2455 rows x 1 columns]

# Filter & Masking

## Personas mayores de 70

In [102]:
df.age

0       66
1       72
2       48
3       59
4       44
        ..
2450    43
2451    18
2452    54
2453    31
2454    52
Name: age, Length: 2455, dtype: int64

In [105]:
mask = df.age > 70

In [106]:
df[mask]

      internet_usage     sex  age   education
1                  1    Male   72  Elementary
10                 0  Female   73  Elementary
14                 0    Male   79  No studies
21                 0  Female   84  Elementary
50                 0  Female   90  Elementary
...              ...     ...  ...         ...
2436               0    Male   82  Elementary
2439               0    Male   74  Elementary
2440               0  Female   77  Elementary
2443               0  Female   80  Elementary
2449               0    Male   92  No studies

[303 rows x 4 columns]

## Personas sin estudios

In [116]:
maskedu = df.education == 'No studies'

In [118]:
df[maskedu]

      internet_usage     sex  age   education
14                 0    Male   79  No studies
28                 0    Male   70  No studies
33                 0  Female   65  No studies
51                 0    Male   79  No studies
70                 0  Female   76  No studies
...              ...     ...  ...         ...
2398               0  Female   78  No studies
2401               0    Male   61  No studies
2405               0  Female   81  No studies
2448               0  Female   64  No studies
2449               0    Male   92  No studies

[177 rows x 4 columns]

## Personas sin estudios & mayores de 70

In [120]:
df[maskedu & mask]

      internet_usage     sex  age   education
14                 0    Male   79  No studies
51                 0    Male   79  No studies
70                 0  Female   76  No studies
71                 0    Male   74  No studies
95                 0    Male   73  No studies
...              ...     ...  ...         ...
2313               0  Female   80  No studies
2397               0    Male   82  No studies
2398               0  Female   78  No studies
2405               0  Female   81  No studies
2449               0    Male   92  No studies

[100 rows x 4 columns]

## Personas sin estudios | mayores de 70

In [121]:
df[maskedu | mask]

      internet_usage     sex  age   education
1                  1    Male   72  Elementary
10                 0  Female   73  Elementary
14                 0    Male   79  No studies
21                 0  Female   84  Elementary
28                 0    Male   70  No studies
...              ...     ...  ...         ...
2439               0    Male   74  Elementary
2440               0  Female   77  Elementary
2443               0  Female   80  Elementary
2448               0  Female   64  No studies
2449               0    Male   92  No studies

[380 rows x 4 columns]

In [87]:
import numpy as np

In [90]:
p = np.percentile(df.age, 50)

In [91]:
p

44.0

In [92]:
df.quantile(q= 0.1)

internet_usage     0.0
age               25.0
Name: 0.1, dtype: float64

In [94]:
df.quantile(q= 0.1, q=0.9)

SyntaxError: keyword argument repeated: q (921167105.py, line 1)

In [95]:
df.quantile(q= 0.1)

internet_usage     0.0
age               25.0
Name: 0.1, dtype: float64

In [97]:
df.quantile(q= 0.9)

internet_usage     1.0
age               73.0
Name: 0.9, dtype: float64

In [98]:
df.quantile(q= [0.1, 0.9])

     internet_usage   age
0.1             0.0  25.0
0.9             1.0  73.0

In [99]:
df.sum()

internet_usage                                                 1315
sex               FemaleMaleMaleMaleFemaleFemaleFemaleMaleMaleMa...
age                                                          114891
education         ElementaryElementaryUniversityPhDPhDPhDPhDUniv...
dtype: object